Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [6]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [17]:
ser1 = pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])

In [18]:
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [19]:
ser2 = pd.Series([1,2,5,4],['USA','GERMANY','ITALY','JAPAN'])

In [20]:
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [21]:
ser1['USA']

1

Pandas Dataframe

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
 df['new'] = [1,2,3,4,5]

In [31]:
df

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [32]:
df.drop

<bound method NDFrame.drop of           W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5>

In [33]:
df

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [36]:
df.drop('new',axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

DataFrame part2

In [38]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [39]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df[(df['W']>0) & (df['X']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [10]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
newind = 'CA NY WY OR CO'.split()

In [22]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [26]:
df['State'] = newind

In [27]:
df

          W         X         Y         Z State  State
A  2.706850  0.628133  0.907969  0.503826     CA    CA
B  0.651118 -0.319318 -0.848077  0.605965     NY    NY
C -2.018168  0.740122  0.528813 -0.589001     WY    WY
D  0.188695 -0.758872 -0.933237  0.955057     OR    OR
E  0.190794  1.978757  2.605967  0.683509     CO    CO

In [28]:
df.set_index('State')

              W         X         Y         Z State
State
CA     2.706850  0.628133  0.907969  0.503826     CA
NY     0.651118 -0.319318 -0.848077  0.605965     NY
WY    -2.018168  0.740122  0.528813 -0.589001     WY
OR     0.188695 -0.758872 -0.933237  0.955057     OR
CO     0.190794  1.978757  2.605967  0.683509     CO

Data Frame part3

In [32]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index  =pd.MultiIndex.from_tuples(hier_index)

In [35]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [37]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [43]:
df['A']

G1  1   -0.925874
    2   -1.133817
    3    0.386030
G2  1   -0.376519
    2    0.681209
    3   -0.031160
Name: A, dtype: float64

In [45]:
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [49]:
df.index.names = ['Groups','Num']

In [50]:
df

                   A         B
Groups Num
G1     1   -0.925874  1.862864
       2   -1.133817  0.610478
       3    0.386030  2.084019
G2     1   -0.376519  0.230336
       2    0.681209  1.035125
       3   -0.031160  1.939932

In [53]:
df.xs('G1')

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

Missing value

In [54]:
 d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [55]:
df = pd.DataFrame(d)

In [56]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [58]:
df.fillna(value='Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [59]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Group by

In [60]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [63]:
df= pd.DataFrame(data)

In [66]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [74]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [70]:
dfgrp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [72]:
dfgrp

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [75]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

Merging Joining Concatenating Data Frame

In [76]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [79]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [80]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [81]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [82]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [83]:
 pd.merge(left,right,how = 'inner',on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [87]:
left.join(right,Index(['key']))

NameError: name 'Index' is not defined

Pandas Operation

In [90]:
df = pd.DataFrame({ 'col1':[1,2,3],
                  'col2':[444,555,666],
                  'col3':['abc','def','ghi']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [93]:
df['col2'].value_counts()

555    1
666    1
444    1
Name: col2, dtype: int64

In [94]:
def times(x):
    return x*2

In [95]:
df['col1']

0    1
1    2
2    3
Name: col1, dtype: int64

In [99]:
df['col2'].apply(times)

0     888
1    1110
2    1332
Name: col2, dtype: int64

In [100]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
Name: col1, dtype: int64

In [101]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi

In [102]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [104]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [106]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

Data Input and Output

In [107]:
pwd

'/home/sudhir/ML/Jose-Python-ML-Bootcamp/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas'

In [2]:
pwd

'/home/sudhir/ML/Jose-Python-ML-Bootcamp/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas'

In [3]:
my_list = [10,20,30]
labels = ['a','b','c']
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(np.array(my_list),labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [17]:
ser1 = pd.Series([1,4,3,2],index = ['USA', 'Germany','USSR', 'Japan'])

In [10]:
ser1['USA']

1

In [20]:
ser1[0]

1

In [25]:
ser1.describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

## Operation

In [ ]:
df = pd.DataFrame()